resources/content/posts/mental-health-toolkit.md
---
title: "A mental health toolkit"
author: ["Luciano Laratelli"]
publishDate: 2023-09-29T11:43:00-04:00
draft: false
---

Over the course of my last regular bout of therapy, my therapist got me to learn about behaviors that he referred to as my mental health toolkit. Some of these behaviors are things we learned are necessary every day (as close as I can get to it) while others are good for times of more difficult mental health challenges than the usual. I'm listing them partly to have them written down for myself, but also in the hopes someone finds a behavior that helps them too. A mental health toolkit can include behaviors that my good friend Mark calls 'psychic anchors' — things you can do to center yourself when you find yourself in need.

For my particular set of mental illnesses, the behaviors I want in my toolkit are those that induce my body to create dopamine (among other regulatory neurotransmitters). Part of the challenge is that some dopamine-creating behaviors don't go about dopamine production in a "sustainable" manner; instead, they cause a dopamine _spike_. You might feel good, really good, for a bit, but then the crash comes and you might end up feeling worse than before. Another part is that there isn't a prescriptive set of the sustainable behaviors that we're looking for that works for everybody. One person's positive mental health behavior might be another's mental health incident trigger. You've got to experiment.

I should note I'm not an expert: I'm just a guy that works at Computer. I _have_ gone to many (many) years of therapy, though. This is what I've learned works for me, and my layman analysis of what that might mean for my brain.

Another important point is that these behaviors don't always work. Some days you can do everything right and still be in the mud psychologically. One of the many injustices of mental illness. But we must do what we can.


## Physical activity {#physical-activity}

This is an important one, and one that most people (anecdotally) find great success with. For me, just going on a long walk isn't enough. I need to get my heart rate up! Cardio and weight-lifting are great for this. I'm not as consistent as I should be but I do feel a large difference in my baseline mental health even going just once.


## Tidying up {#tidying-up}

It was kind of funny to find out how much this helped me. I always dreaded doing household chores (the self-sabotaging nature of ADHD is horrific) but once I realized how much better I feel when our space is neat I started actively seeking out opportunities to pick up. This positive feedback loop is very powerful:

```text
I feel good -> let me clean up a little
     ↑                     ↓
      ↖                   ↙
         Our space is clean
```

While this one is dangerous:

```text
I feel bad -> tidying up is the worst thing I can imagine
    ↑                       ↓
     ↖                    ↙
       Our space is messy
```

I wasn't able to really harness the positive feedback loop until I started taking medication _that actually worked for me_.


## Medication {#medication}

I spent years in undergrad trying but failing to find medication that worked for me. This type of diagnosis is hard! Eventually I just stopped taking medication altogether and dealt with life raw. It was only when I started seeing my latest therapist that I was able to get a proper diagnosis. After a couple sessions with me, he blew my mind when he said I had "a textbook case of undiagnosed adult ADHD." ADHD medication changed almost everything about how I engage with my life. It can't and won't be a solution for everyone, but if you have a therapist and doctor you trust and they recommend something, I hope it is helpful.


## Socializing {#socializing}

I spent most of my life thinking I was an introvert because I felt awkward in social situations. Some of those feelings were certainly part of the process of coming into my own as a person — finding your way as a teenager and young adult can be hard! Looking back, I now recognize that many of those feelings stemmed from mental illness. That type of feeling can often push you _away_ from socializing.

I learned I'm not an introvert when the government began reducing COVID restrictions and people started congregating again. I've always worked from home, but because I started working professionally in 2021, I had no ability to get out of the house for much of my early professional life. Once I had the ability to do so, I realized I _needed_ to — that social contact was deeply energizing for me in a restorative way. This is different than for my partner, who is a self-described "extroverted-introvert". She feels the need to recharge her social batteries with some alone time after a series of repeated outings.

Getting adequate amounts of socializing is tough, because working from home means I don't really have a "third place".[^fn:1] A potential solution is just paying for one by going to a local coffee shop or buying access to a co-working space. Though I do like to go to our local coffee shop, it isn't a perfect solution because of the ongoing costs, the un-ergonomic work environment, and the difficulties of taking meetings in a public space. Co-working spaces are even more expensive than a daily coffee or two. This is all cheaper than a daily commute, of course.

"Just go out on weekends" is not an end-all solution either. Weekend outings are great, and definitely help! But they yield a big dopamine spike compared to the steady socializing you might get from a co-working space or commuting to an office.[^fn:2] This isn't something I always _want_ to do, either — if my partner wants to stay in to decompress, going out means her sacrificing her social battery recharging time for my well-being (I love her for this, but it's not ideal) or it means not necessarily spending quality weekend time together. It certainly isn't a requirement that we be joined at the hip all weekend, so sometimes I go this route. Going out, of course, costs money. Very few social places remain where you can go without paying for the privilege.

I have contemplated getting an in-person or hybrid job, but the Miami tech scene is not conducive to my doing so. There's a lot of reasons for this that aren't related to this post, so I won't get into them. I would also probably have to buy a car, which seems like nasty business given how much I've enjoyed being car-free for the last couple years.


## Journaling {#journaling}

My boss at my first software job (a great person) taught me this one when I expressed I was overwhelmed with the number of tasks I had to do for a project. He told me to write everything down to get it out of my head. It is shocking how much it helps. My therapist later taught me I should be doing this for my personal things too. Especially in moments where my mental health is poor, journaling helps me to externalize those thoughts.

One of my first girlfriends (my first serious girlfriend) taught me about writing a letter when you're angry at someone, explaining how you feel. Then you shred or burn it. The process of writing down how you feel while addressing it to someone is a calming exercise that helps you settle before talking to the person about how you feel (related: "Never send an email when you're angry.")

Blogging is a similar tool. _I'm doing it right now!_ I think it's better for writing about things I've learned and want to have somewhere than for my thoughts and feelings, especially when I'm in a poor state of mental health — the privacy of the journal page brings a lot of psychological safety. I also don't have to edit out curse words. But having a written, public record of an idea makes you refine the thought in a way that journaling doesn't. You have to pick the right tool for the job.


## Taking a shower {#taking-a-shower}

This is the primary "psychic anchor" I learned from Mark. This doesn't refer to a needed shower as part of a regular hygiene schedule, though it can. This refers to the positive effect of taking a step out of the (physical, mental, emotional) space I'm in and taking a quiet couple minutes in the shower. It's really effective and helps a lot for anxiety. This is more of a "quick fix" type strategy than the others, but the dopamine spike is long lasting.

I've been dabbling with cold showers recently, and have really been enjoying it. I can't explain why, but after the initial five seconds of "damn, that's cold!" I feel _good_. It feels good to do something that involves "mental toughness" but that isn't the only aspect that's pleasant about it.

[^fn:1]: See [wikipedia](https://en.wikipedia.org/wiki/Third_place)
[^fn:2]: This is a huge topic on its own; I don't want to derail by getting into the 800 externalities on each side of the WFH debate.